"""
Варіант 8

Задача №1: Визначте суму усіх елементів послідовності, яка завершується числом 0. Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а використовується як ознака її закінчення).
Автор: Гладкович Ярослав
"""

# Просимо користувача ввести послідовність цілих чисел
input_str = input("Введіть послідовність цілих чисел")

# Розбиваємо введену стрічку на список чисел
numbers = list(map(int, input_str.split()))

# Ініціалізуємо змінну для збереження загальної суми
total_sum = 0

# Циклом обходимо введений список чисел та додаємо до загальної суми
for num in numbers:
    if num == 0:
        break
    total_sum += num

# Виводимо загальну суму
print("Загальна сума:", total_sum)