"""
Варіант 8

Задача №2: Дано натуральне число n. Визначте, яким за рахунком числом Фібоначчі воно є. Якщо n не є числом Фібоначчі, виведіть значення   -1.
Автор: Гладкович Ярослав
"""

def isPerfectSquare(x):
    s = int(x ** 0.5)
    return s * s == x

def isFibonacci(n):
    return isPerfectSquare(5 * n * n + 4) or isPerfectSquare(5 * n * n - 4)

# Отримуємо введене користувачем число
num = int(input("Введіть натуральне число: "))

# Перевіряємо чи є введене число числом Фібоначчі
if isFibonacci(num):
    print("Число", num, "є числом Фібоначчі.")
else:
    print("Число", num, "не є числом Фібоначчі,а тому значення -1.")